MI4CApp/app/Controllers/Film.php


            return redirect()->back()->withInput()->with('errors', $errors);
        }
        $film = $this->film->find($this->request->getPost('id'));
---
SELECT *
FROM `film`
WHERE `film`.`id` = '1'

            $data['cover'] = $imageName;

        }
        $this->film->save($data);
---
UPDATE `film` SET `nama_film` = 'Doa Bapak Kita', `id_genre` = '1', `duration` = ' 1 jam 43 menit'
WHERE `film`.`id` IN ('1')