MI4CApp/app/Models/GenreModel.php

SELECT *
FROM `genre`
---
   public function getAllData()
   {
      return $this->findAll();